<?php

function qa_q_request($questionid, $title)
{
	$greek = array("ου","ού","α","β","γ","δ","ε","ζ","η","θ","ι","κ","λ","μ","ν","ξ","ο","π","ρ","σ","τ","υ","φ","χ","ψ","ω","ά","έ","ή","ί","ό","ύ","ώ","Ου","Ού","Α","Β","Γ","Δ","Ε","Ζ","Η","Θ","Ι","Κ","Λ","Μ","Ν","Ξ","Ο","Π","Ρ","Σ","Τ","Υ","Φ","Χ","Ψ","Ω","Ά","Έ","Ή","Ί","Ό","Ύ","Ώ","ς","ϊ","ΐ");
	$greeklish = array("ou","ou","a","v","g","d","e","z","i","th","i","k","l","m","n","ks","o","p","r","s","t","u","f","x","ps","o","a","e","i","i","o","i","o","ou","ou","a","b","g","d","e","z","i","th","i","k","l","m","n","ks","o","p","r","s","t","i","f","x","ps","o","a","e","i","i","o","i","o","s","i","i");

	$title = str_replace($greek, $greeklish, $title);
	return qa_q_request_base($questionid, $title);
}